Revit 2015 API
DWGImportOptions Properties
The DWGImportOptions type exposes the following members.
Properties
Name | Description
AutoCorrectAlmostVHLines
 Correct almost-vertical lines and almost-horizontal lines for import model if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.
 (Inherited from BaseImportOptions.)
ColorMode
 Color mode for the import. Three modes are supported. Black and White, Preserve Colors, and Invert Colors.
 (Inherited from BaseImportOptions.)
CustomScale
 Scaling the import. If this is defined and a valid value (> 0.0), it takes preference over units.
 (Inherited from BaseImportOptions.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from BaseImportOptions.)
OrientToView
 Place the import at the same orientation as the view that was passed into the import method. This option can only be used when not importing into a single view.(i.e. ThisViewOnly is set to false)
 (Inherited from BaseImportOptions.)
Placement
 Where to place the import. Set this option to place the view at the origin or the center, or a shared coordinates.
 (Inherited from BaseImportOptions.)
ThisViewOnly
 Imports drawings into the view that was passed into the import method. This option is not available in 3D views.
 (Inherited from BaseImportOptions.)
Unit
 The unit of measure for imported geometry.
 (Inherited from BaseImportOptions.)
VisibleLayersOnly
 Only import the visible layers.
 (Inherited from BaseImportOptions.)
See Also
DWGImportOptions Class
Autodesk.Revit.DB Namespace